Tekla Open API Reference for Tekla Structures 2025
SpiralBeam.RotationAngle Property
 Gets or sets the rotation of the spiral beam in degrees. Each range of 360.0 degrees adds a full rotation.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double RotationAngle { get; set; }
Public Property RotationAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SpiralBeam Class
Tekla.Structures.Model Namespace